toasterllc/MDCCode/Code/STM32/STApp/Source/System.cpp
    // ====================
    // CMD18 | READ_MULTIPLE_BLOCK
    //   State: Transfer -> Send Data
    //   Read blocks of data (1 block == 512 bytes)
    // ====================
    {
        auto status = _sdSendCmd(18, 0, SDRespTypes::Len48, SDDatInTypes::Len4096xN);
        Assert(!status.respCRCErr());
    }
    
    // Send the SDReadout message, which causes us to enter the SD-readout mode until
    // we release the chip select
    _ICE_ST_SPI_CS_::Write(0);
    _ice40TransferNoCS(SDReadoutMsg());
    
    // Advance state machine
    _sdRead_updateState();
}

void System::_sdRead_qspiReadToBuf() {
    Assert(_op == Op::SDRead);
    Assert(!_bufs.full());
    Assert(_opDataRem);
    Assert(!_qspiBusy);
    
    auto& buf = _bufs.back();
    
    // Wait for ICE40 to signal that data is ready
    while (!_ICE_ST_SPI_D_READY::Read());
    
    // TODO: how do we handle lengths that aren't a multiple of ReadoutLen?
    const size_t len = SDReadoutMsg::ReadoutLen;
    QSPI_CommandTypeDef qspiCmd = {
        .InstructionMode = QSPI_INSTRUCTION_NONE,
        .AddressMode = QSPI_ADDRESS_NONE,
        .AlternateByteMode = QSPI_ALTERNATE_BYTES_NONE,
        .DummyCycles = 8,
        .NbData = (uint32_t)len,
        .DataMode = QSPI_DATA_4_LINES,
        .DdrMode = QSPI_DDR_MODE_DISABLE,
        .DdrHoldHalfCycle = QSPI_DDR_HHC_ANALOG_DELAY,
        .SIOOMode = QSPI_SIOO_INST_EVERY_CMD,
    };
    
    _qspi.read(qspiCmd, buf.data+buf.len, len);
    buf.len += len;
    
    _qspiBusy = true;
}

void System::_sdRead_qspiReadToBufSync(void* buf, size_t len) {
    // Assert chip-select so that we stay in the readout state until we release it
    _ICE_ST_SPI_CS_::Write(0);
    
    // Send the SDReadout message, which causes us to enter the SD-readout mode until
    // we release the chip select
    _ice40TransferNoCS(SDReadoutMsg());
    
    // TODO: how do we handle lengths that aren't a multiple of ReadoutLen?
    QSPI_CommandTypeDef qspiCmd = {
        .InstructionMode = QSPI_INSTRUCTION_NONE,
        .AddressMode = QSPI_ADDRESS_NONE,
        .AlternateByteMode = QSPI_ALTERNATE_BYTES_NONE,
        .DummyCycles = 8,
        .NbData = (uint32_t)len,
        .DataMode = QSPI_DATA_4_LINES,
        .DdrMode = QSPI_DDR_MODE_DISABLE,
        .DdrHoldHalfCycle = QSPI_DDR_HHC_ANALOG_DELAY,
        .SIOOMode = QSPI_SIOO_INST_EVERY_CMD,
    };
    
    _qspi.read(qspiCmd, buf, len);
    _qspi.eventChannel.read(); // Wait for the transfer to complete
    
    _ICE_ST_SPI_CS_::Write(1);
}

void System::_sdRead_qspiEventHandle(const QSPI::Signal& ev) {
    Assert(_op == Op::SDRead);
    Assert(_qspiBusy);
    
    auto& buf = _bufs.back();
    _qspiBusy = false;
    
    // If we can't read any more data into the producer buffer,
    // push it so the data will be sent over USB
    if (buf.cap-buf.len < SDReadoutMsg::ReadoutLen) {
        _opDataRem -= buf.len;
        _bufs.push();
    }
    
    // Advance state machine
    _sdRead_updateState();
}

void System::_sdRead_usbDataSendHandle(const USB::DataSend& ev) {
    Assert(_op == Op::SDRead);
    // Advance state machine
    _sdRead_updateState();
}






//// Arrange for pix data to be received from ICE40
//void System::_recvPixDataFromICE40() {
//    Assert(!_bufs.full());
//    
//    // TODO: ensure that the byte length is aligned to a u32 boundary, since QSPI requires that!
//    const size_t len = std::min(_pixRemLen, _bufs.back().cap);
//    // Determine whether this is the last readout, and therefore the ice40 should automatically
//    // capture the next image when readout is done.
////    const bool captureNext = (len == _pixRemLen);
//    const bool captureNext = false;
//    _bufs.back().len = len;
//    
//    _ice40TransferAsync(_qspi, PixReadoutMsg(0, captureNext, len/sizeof(Pixel)),
//        _bufs.back().data,
//        _bufs.back().len);
//}

//// Arrange for pix data to be sent over USB
//void System::_sendPixDataOverUSB() {
//    Assert(!_bufs.empty());
//    const auto& buf = _bufs.front();
//    _usb.pixSend(buf.data, buf.len);
//}

void System::_sdRead_updateState() {
    // Read data into the producer buffer when:
    //   - there's more data to be read, and
    //   - there's space in the queue, and
    //   - QSPI isn't currently reading data into the queue
    if (_opDataRem && !_bufs.full() && !_qspiBusy) {
        _sdRead_qspiReadToBuf();
    }
    
    // Send data from the consumer buffer when:
    //   - we have data to write, and
    //   - we're not currently sending data over USB
    if (!_bufs.empty() && !_usbDataBusy) {
        _usb_sendFromBuf();
    }
    
    // We're done when:
    //   - there's no more data to be read, and
    //   - there's no more data to send over USB
    if (!_opDataRem && _bufs.empty()) {
        _sdRead_finish();
    }
}

void System::_sdRead_finish() {
    _ICE_ST_SPI_CS_::Write(1);
    _finishCmd(Status::OK);
}

#pragma mark - Other Commands

void System::_ledSet(const Cmd& cmd) {
    switch (cmd.arg.LEDSet.idx) {
    case 0: _finishCmd(Status::Error); return;
    case 1: _LED1::Write(cmd.arg.LEDSet.on); break;
    case 2: _LED2::Write(cmd.arg.LEDSet.on); break;
    case 3: _LED3::Write(cmd.arg.LEDSet.on); break;
    }
    
    _finishCmd(Status::OK);
}

System Sys;

int main() {
    Sys.init();
    // Event loop
    for (;;) {
        Sys._handleEvent();
    }
    return 0;
}

[[noreturn]] void abort() {
    Sys.abort();
}
